* Aleatorios
  :PROPERTIES:
  :ID:       4dab9808-e421-4595-90ac-e00add09a0d2
  :END:

#+BEGIN_SRC R


A <- runif(3)

A <- runif(3,0,10)

#+END_SRC

#+RESULTS:
| 4.31273924885318 |
| 8.89114164747298 |
| 7.88042935077101 |



** Cambios de acuerdo a una posicion
   :PROPERTIES:
   :ID:       7dced311-c7e7-4333-845a-f6e71001e36a
   :END:

#+BEGIN_SRC R :session nuevo

B[B<0.5] <- 0

B

#+END_SRC

#+RESULTS:
| 0.918500847183168 |                 0 |                0 |
|                 0 | 0.744151385035366 |                0 |
|                 0 | 0.904849631013349 | 0.69571947818622 |
| 0.924160549184307 |                 0 | 0.90982540557161 |



* Listas
  :PROPERTIES:
  :ID:       c9e2c4c1-ee29-4041-95f3-dc7b8fddbf2b
  :END:

  #+BEGIN_SRC R
  l <- list(a=1,b=2,c=3)

  l$a
  #+END_SRC

  #+RESULTS:
  : 1

** IF - ELSE STATEMENT
   :PROPERTIES:
   :ID:       a0eba499-ce13-4061-b6c3-a0b863be5f95
   :END:


#+BEGIN_SRC R

if(1 < 2) {print(1)} else {print(2)}

x <- if (1 < 2) 1 else 2 

x <- ifelse(1<2,1,2)



#+END_SRC

#+RESULTS:
: 1


